qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L0/TARGET_NUCLEO_L053R8/stm32l053xx.h
/******************  Bit definition for GPIO_OTYPER register  *****************/
#define GPIO_OTYPER_OT_0          ((uint32_t)0x00000001)
#define GPIO_OTYPER_OT_1          ((uint32_t)0x00000002)
#define GPIO_OTYPER_OT_2          ((uint32_t)0x00000004)
#define GPIO_OTYPER_OT_3          ((uint32_t)0x00000008)
#define GPIO_OTYPER_OT_4          ((uint32_t)0x00000010)
#define GPIO_OTYPER_OT_5          ((uint32_t)0x00000020)
#define GPIO_OTYPER_OT_6          ((uint32_t)0x00000040)
#define GPIO_OTYPER_OT_7          ((uint32_t)0x00000080)
#define GPIO_OTYPER_OT_8          ((uint32_t)0x00000100)
#define GPIO_OTYPER_OT_9          ((uint32_t)0x00000200)
#define GPIO_OTYPER_OT_10         ((uint32_t)0x00000400)
#define GPIO_OTYPER_OT_11         ((uint32_t)0x00000800)
#define GPIO_OTYPER_OT_12         ((uint32_t)0x00001000)
#define GPIO_OTYPER_OT_13         ((uint32_t)0x00002000)
#define GPIO_OTYPER_OT_14         ((uint32_t)0x00004000)
#define GPIO_OTYPER_OT_15         ((uint32_t)0x00008000)

/****************  Bit definition for GPIO_OSPEEDR register  ******************/
#define GPIO_OSPEEDER_OSPEED0     ((uint32_t)0x00000003)
#define GPIO_OSPEEDER_OSPEED0_0   ((uint32_t)0x00000001)
#define GPIO_OSPEEDER_OSPEED0_1   ((uint32_t)0x00000002)
#define GPIO_OSPEEDER_OSPEED1     ((uint32_t)0x0000000C)
#define GPIO_OSPEEDER_OSPEED1_0   ((uint32_t)0x00000004)
#define GPIO_OSPEEDER_OSPEED1_1   ((uint32_t)0x00000008)
#define GPIO_OSPEEDER_OSPEED2     ((uint32_t)0x00000030)
#define GPIO_OSPEEDER_OSPEED2_0   ((uint32_t)0x00000010)
#define GPIO_OSPEEDER_OSPEED2_1   ((uint32_t)0x00000020)
#define GPIO_OSPEEDER_OSPEED3     ((uint32_t)0x000000C0)
#define GPIO_OSPEEDER_OSPEED3_0   ((uint32_t)0x00000040)
#define GPIO_OSPEEDER_OSPEED3_1   ((uint32_t)0x00000080)
#define GPIO_OSPEEDER_OSPEED4     ((uint32_t)0x00000300)
#define GPIO_OSPEEDER_OSPEED4_0   ((uint32_t)0x00000100)
#define GPIO_OSPEEDER_OSPEED4_1   ((uint32_t)0x00000200)
#define GPIO_OSPEEDER_OSPEED5     ((uint32_t)0x00000C00)
#define GPIO_OSPEEDER_OSPEED5_0   ((uint32_t)0x00000400)
#define GPIO_OSPEEDER_OSPEED5_1   ((uint32_t)0x00000800)
#define GPIO_OSPEEDER_OSPEED6     ((uint32_t)0x00003000)
#define GPIO_OSPEEDER_OSPEED6_0   ((uint32_t)0x00001000)
#define GPIO_OSPEEDER_OSPEED6_1   ((uint32_t)0x00002000)
#define GPIO_OSPEEDER_OSPEED7     ((uint32_t)0x0000C000)
#define GPIO_OSPEEDER_OSPEED7_0   ((uint32_t)0x00004000)
#define GPIO_OSPEEDER_OSPEED7_1   ((uint32_t)0x00008000)
#define GPIO_OSPEEDER_OSPEED8     ((uint32_t)0x00030000)
#define GPIO_OSPEEDER_OSPEED8_0   ((uint32_t)0x00010000)
#define GPIO_OSPEEDER_OSPEED8_1   ((uint32_t)0x00020000)
#define GPIO_OSPEEDER_OSPEED9     ((uint32_t)0x000C0000)
#define GPIO_OSPEEDER_OSPEED9_0   ((uint32_t)0x00040000)
#define GPIO_OSPEEDER_OSPEED9_1   ((uint32_t)0x00080000)
#define GPIO_OSPEEDER_OSPEED10    ((uint32_t)0x00300000)
#define GPIO_OSPEEDER_OSPEED10_0  ((uint32_t)0x00100000)
#define GPIO_OSPEEDER_OSPEED10_1  ((uint32_t)0x00200000)
#define GPIO_OSPEEDER_OSPEED11    ((uint32_t)0x00C00000)
#define GPIO_OSPEEDER_OSPEED11_0  ((uint32_t)0x00400000)
#define GPIO_OSPEEDER_OSPEED11_1  ((uint32_t)0x00800000)
#define GPIO_OSPEEDER_OSPEED12    ((uint32_t)0x03000000)
#define GPIO_OSPEEDER_OSPEED12_0  ((uint32_t)0x01000000)
#define GPIO_OSPEEDER_OSPEED12_1  ((uint32_t)0x02000000)
#define GPIO_OSPEEDER_OSPEED13    ((uint32_t)0x0C000000)
#define GPIO_OSPEEDER_OSPEED13_0  ((uint32_t)0x04000000)
#define GPIO_OSPEEDER_OSPEED13_1  ((uint32_t)0x08000000)
#define GPIO_OSPEEDER_OSPEED14    ((uint32_t)0x30000000)
#define GPIO_OSPEEDER_OSPEED14_0  ((uint32_t)0x10000000)
#define GPIO_OSPEEDER_OSPEED14_1  ((uint32_t)0x20000000)
#define GPIO_OSPEEDER_OSPEED15    ((uint32_t)0xC0000000)
#define GPIO_OSPEEDER_OSPEED15_0  ((uint32_t)0x40000000)
#define GPIO_OSPEEDER_OSPEED15_1  ((uint32_t)0x80000000)

/*******************  Bit definition for GPIO_PUPDR register ******************/
#define GPIO_PUPDR_PUPD0          ((uint32_t)0x00000003)
#define GPIO_PUPDR_PUPD0_0        ((uint32_t)0x00000001)
#define GPIO_PUPDR_PUPD0_1        ((uint32_t)0x00000002)
#define GPIO_PUPDR_PUPD1          ((uint32_t)0x0000000C)
#define GPIO_PUPDR_PUPD1_0        ((uint32_t)0x00000004)
#define GPIO_PUPDR_PUPD1_1        ((uint32_t)0x00000008)
#define GPIO_PUPDR_PUPD2          ((uint32_t)0x00000030)
#define GPIO_PUPDR_PUPD2_0        ((uint32_t)0x00000010)
#define GPIO_PUPDR_PUPD2_1        ((uint32_t)0x00000020)
#define GPIO_PUPDR_PUPD3          ((uint32_t)0x000000C0)
#define GPIO_PUPDR_PUPD3_0        ((uint32_t)0x00000040)
#define GPIO_PUPDR_PUPD3_1        ((uint32_t)0x00000080)
#define GPIO_PUPDR_PUPD4          ((uint32_t)0x00000300)
#define GPIO_PUPDR_PUPD4_0        ((uint32_t)0x00000100)
#define GPIO_PUPDR_PUPD4_1        ((uint32_t)0x00000200)
#define GPIO_PUPDR_PUPD5          ((uint32_t)0x00000C00)
#define GPIO_PUPDR_PUPD5_0        ((uint32_t)0x00000400)
#define GPIO_PUPDR_PUPD5_1        ((uint32_t)0x00000800)
#define GPIO_PUPDR_PUPD6          ((uint32_t)0x00003000)
#define GPIO_PUPDR_PUPD6_0        ((uint32_t)0x00001000)
#define GPIO_PUPDR_PUPD6_1        ((uint32_t)0x00002000)
#define GPIO_PUPDR_PUPD7          ((uint32_t)0x0000C000)
#define GPIO_PUPDR_PUPD7_0        ((uint32_t)0x00004000)
#define GPIO_PUPDR_PUPD7_1        ((uint32_t)0x00008000)
#define GPIO_PUPDR_PUPD8          ((uint32_t)0x00030000)
#define GPIO_PUPDR_PUPD8_0        ((uint32_t)0x00010000)
#define GPIO_PUPDR_PUPD8_1        ((uint32_t)0x00020000)
#define GPIO_PUPDR_PUPD9          ((uint32_t)0x000C0000)
#define GPIO_PUPDR_PUPD9_0        ((uint32_t)0x00040000)
#define GPIO_PUPDR_PUPD9_1        ((uint32_t)0x00080000)
#define GPIO_PUPDR_PUPD10         ((uint32_t)0x00300000)
#define GPIO_PUPDR_PUPD10_0       ((uint32_t)0x00100000)
#define GPIO_PUPDR_PUPD10_1       ((uint32_t)0x00200000)
#define GPIO_PUPDR_PUPD11         ((uint32_t)0x00C00000)
#define GPIO_PUPDR_PUPD11_0       ((uint32_t)0x00400000)
#define GPIO_PUPDR_PUPD11_1       ((uint32_t)0x00800000)
#define GPIO_PUPDR_PUPD12         ((uint32_t)0x03000000)
#define GPIO_PUPDR_PUPD12_0       ((uint32_t)0x01000000)
#define GPIO_PUPDR_PUPD12_1       ((uint32_t)0x02000000)
#define GPIO_PUPDR_PUPD13         ((uint32_t)0x0C000000)
#define GPIO_PUPDR_PUPD13_0       ((uint32_t)0x04000000)
#define GPIO_PUPDR_PUPD13_1       ((uint32_t)0x08000000)
#define GPIO_PUPDR_PUPD14         ((uint32_t)0x30000000)
#define GPIO_PUPDR_PUPD14_0       ((uint32_t)0x10000000)
#define GPIO_PUPDR_PUPD14_1       ((uint32_t)0x20000000)
#define GPIO_PUPDR_PUPD15         ((uint32_t)0xC0000000)
#define GPIO_PUPDR_PUPD15_0       ((uint32_t)0x40000000)
#define GPIO_PUPDR_PUPD15_1       ((uint32_t)0x80000000)

/*******************  Bit definition for GPIO_IDR register  *******************/
#define GPIO_IDR_ID0              ((uint32_t)0x00000001)
#define GPIO_IDR_ID1              ((uint32_t)0x00000002)
#define GPIO_IDR_ID2              ((uint32_t)0x00000004)
#define GPIO_IDR_ID3              ((uint32_t)0x00000008)
#define GPIO_IDR_ID4              ((uint32_t)0x00000010)
#define GPIO_IDR_ID5              ((uint32_t)0x00000020)
#define GPIO_IDR_ID6              ((uint32_t)0x00000040)
#define GPIO_IDR_ID7              ((uint32_t)0x00000080)
#define GPIO_IDR_ID8              ((uint32_t)0x00000100)
#define GPIO_IDR_ID9              ((uint32_t)0x00000200)
#define GPIO_IDR_ID10             ((uint32_t)0x00000400)
#define GPIO_IDR_ID11             ((uint32_t)0x00000800)
#define GPIO_IDR_ID12             ((uint32_t)0x00001000)
#define GPIO_IDR_ID13             ((uint32_t)0x00002000)
#define GPIO_IDR_ID14             ((uint32_t)0x00004000)
#define GPIO_IDR_ID15             ((uint32_t)0x00008000)

/******************  Bit definition for GPIO_ODR register  ********************/
#define GPIO_ODR_OD0              ((uint32_t)0x00000001)
#define GPIO_ODR_OD1              ((uint32_t)0x00000002)
#define GPIO_ODR_OD2              ((uint32_t)0x00000004)
#define GPIO_ODR_OD3              ((uint32_t)0x00000008)
#define GPIO_ODR_OD4              ((uint32_t)0x00000010)
#define GPIO_ODR_OD5              ((uint32_t)0x00000020)
#define GPIO_ODR_OD6              ((uint32_t)0x00000040)
#define GPIO_ODR_OD7              ((uint32_t)0x00000080)
#define GPIO_ODR_OD8              ((uint32_t)0x00000100)
#define GPIO_ODR_OD9              ((uint32_t)0x00000200)
#define GPIO_ODR_OD10             ((uint32_t)0x00000400)
#define GPIO_ODR_OD11             ((uint32_t)0x00000800)
#define GPIO_ODR_OD12             ((uint32_t)0x00001000)
#define GPIO_ODR_OD13             ((uint32_t)0x00002000)
#define GPIO_ODR_OD14             ((uint32_t)0x00004000)
#define GPIO_ODR_OD15             ((uint32_t)0x00008000)

/****************** Bit definition for GPIO_BSRR register  ********************/
#define GPIO_BSRR_BS_0            ((uint32_t)0x00000001)
#define GPIO_BSRR_BS_1            ((uint32_t)0x00000002)
#define GPIO_BSRR_BS_2            ((uint32_t)0x00000004)
#define GPIO_BSRR_BS_3            ((uint32_t)0x00000008)
#define GPIO_BSRR_BS_4            ((uint32_t)0x00000010)
#define GPIO_BSRR_BS_5            ((uint32_t)0x00000020)
#define GPIO_BSRR_BS_6            ((uint32_t)0x00000040)
#define GPIO_BSRR_BS_7            ((uint32_t)0x00000080)
#define GPIO_BSRR_BS_8            ((uint32_t)0x00000100)
#define GPIO_BSRR_BS_9            ((uint32_t)0x00000200)
#define GPIO_BSRR_BS_10           ((uint32_t)0x00000400)
#define GPIO_BSRR_BS_11           ((uint32_t)0x00000800)
#define GPIO_BSRR_BS_12           ((uint32_t)0x00001000)
#define GPIO_BSRR_BS_13           ((uint32_t)0x00002000)
#define GPIO_BSRR_BS_14           ((uint32_t)0x00004000)
#define GPIO_BSRR_BS_15           ((uint32_t)0x00008000)
#define GPIO_BSRR_BR_0            ((uint32_t)0x00010000)
#define GPIO_BSRR_BR_1            ((uint32_t)0x00020000)
#define GPIO_BSRR_BR_2            ((uint32_t)0x00040000)
#define GPIO_BSRR_BR_3            ((uint32_t)0x00080000)
#define GPIO_BSRR_BR_4            ((uint32_t)0x00100000)
#define GPIO_BSRR_BR_5            ((uint32_t)0x00200000)
#define GPIO_BSRR_BR_6            ((uint32_t)0x00400000)
#define GPIO_BSRR_BR_7            ((uint32_t)0x00800000)
#define GPIO_BSRR_BR_8            ((uint32_t)0x01000000)
#define GPIO_BSRR_BR_9            ((uint32_t)0x02000000)
#define GPIO_BSRR_BR_10           ((uint32_t)0x04000000)
#define GPIO_BSRR_BR_11           ((uint32_t)0x08000000)
#define GPIO_BSRR_BR_12           ((uint32_t)0x10000000)
#define GPIO_BSRR_BR_13           ((uint32_t)0x20000000)
#define GPIO_BSRR_BR_14           ((uint32_t)0x40000000)
#define GPIO_BSRR_BR_15           ((uint32_t)0x80000000)

/****************** Bit definition for GPIO_LCKR register  ********************/
#define GPIO_LCKR_LCK0            ((uint32_t)0x00000001)
#define GPIO_LCKR_LCK1            ((uint32_t)0x00000002)
#define GPIO_LCKR_LCK2            ((uint32_t)0x00000004)
#define GPIO_LCKR_LCK3            ((uint32_t)0x00000008)
#define GPIO_LCKR_LCK4            ((uint32_t)0x00000010)
#define GPIO_LCKR_LCK5            ((uint32_t)0x00000020)
#define GPIO_LCKR_LCK6            ((uint32_t)0x00000040)
#define GPIO_LCKR_LCK7            ((uint32_t)0x00000080)
#define GPIO_LCKR_LCK8            ((uint32_t)0x00000100)
#define GPIO_LCKR_LCK9            ((uint32_t)0x00000200)
#define GPIO_LCKR_LCK10           ((uint32_t)0x00000400)
#define GPIO_LCKR_LCK11           ((uint32_t)0x00000800)
#define GPIO_LCKR_LCK12           ((uint32_t)0x00001000)
#define GPIO_LCKR_LCK13           ((uint32_t)0x00002000)
#define GPIO_LCKR_LCK14           ((uint32_t)0x00004000)
#define GPIO_LCKR_LCK15           ((uint32_t)0x00008000)
#define GPIO_LCKR_LCKK            ((uint32_t)0x00010000)

/****************** Bit definition for GPIO_BRR register  *********************/
#define GPIO_BRR_BR_0             ((uint32_t)0x00000001)
#define GPIO_BRR_BR_1             ((uint32_t)0x00000002)
#define GPIO_BRR_BR_2             ((uint32_t)0x00000004)
#define GPIO_BRR_BR_3             ((uint32_t)0x00000008)
#define GPIO_BRR_BR_4             ((uint32_t)0x00000010)
#define GPIO_BRR_BR_5             ((uint32_t)0x00000020)
#define GPIO_BRR_BR_6             ((uint32_t)0x00000040)
#define GPIO_BRR_BR_7             ((uint32_t)0x00000080)
#define GPIO_BRR_BR_8             ((uint32_t)0x00000100)
#define GPIO_BRR_BR_9             ((uint32_t)0x00000200)
#define GPIO_BRR_BR_10            ((uint32_t)0x00000400)
#define GPIO_BRR_BR_11            ((uint32_t)0x00000800)
#define GPIO_BRR_BR_12            ((uint32_t)0x00001000)
#define GPIO_BRR_BR_13            ((uint32_t)0x00002000)
#define GPIO_BRR_BR_14            ((uint32_t)0x00004000)
#define GPIO_BRR_BR_15            ((uint32_t)0x00008000)

/******************************************************************************/
/*                                                                            */
/*                   Inter-integrated Circuit Interface (I2C)                 */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for I2C_CR1 register  *******************/
#define I2C_CR1_PE                          ((uint32_t)0x00000001)        /*!< Peripheral enable */
#define I2C_CR1_TXIE                        ((uint32_t)0x00000002)        /*!< TX interrupt enable */
#define I2C_CR1_RXIE                        ((uint32_t)0x00000004)        /*!< RX interrupt enable */
#define I2C_CR1_ADDRIE                      ((uint32_t)0x00000008)        /*!< Address match interrupt enable */
#define I2C_CR1_NACKIE                      ((uint32_t)0x00000010)        /*!< NACK received interrupt enable */
#define I2C_CR1_STOPIE                      ((uint32_t)0x00000020)        /*!< STOP detection interrupt enable */
#define I2C_CR1_TCIE                        ((uint32_t)0x00000040)        /*!< Transfer complete interrupt enable */
#define I2C_CR1_ERRIE                       ((uint32_t)0x00000080)        /*!< Errors interrupt enable */
#define I2C_CR1_DFN                         ((uint32_t)0x00000F00)        /*!< Digital noise filter */
#define I2C_CR1_ANFOFF                      ((uint32_t)0x00001000)        /*!< Analog noise filter OFF */
#define I2C_CR1_TXDMAEN                     ((uint32_t)0x00004000)        /*!< DMA transmission requests enable */
#define I2C_CR1_RXDMAEN                     ((uint32_t)0x00008000)        /*!< DMA reception requests enable */
#define I2C_CR1_SBC                         ((uint32_t)0x00010000)        /*!< Slave byte control */
#define I2C_CR1_NOSTRETCH                   ((uint32_t)0x00020000)        /*!< Clock stretching disable */
#define I2C_CR1_WUPEN                       ((uint32_t)0x00040000)        /*!< Wakeup from STOP enable */
#define I2C_CR1_GCEN                        ((uint32_t)0x00080000)        /*!< General call enable */
#define I2C_CR1_SMBHEN                      ((uint32_t)0x00100000)        /*!< SMBus host address enable */
#define I2C_CR1_SMBDEN                      ((uint32_t)0x00200000)        /*!< SMBus device default address enable */
#define I2C_CR1_ALERTEN                     ((uint32_t)0x00400000)        /*!< SMBus alert enable */
#define I2C_CR1_PECEN                       ((uint32_t)0x00800000)        /*!< PEC enable */

/******************  Bit definition for I2C_CR2 register  ********************/
#define I2C_CR2_SADD                        ((uint32_t)0x000003FF)        /*!< Slave address (master mode) */
#define I2C_CR2_RD_WRN                      ((uint32_t)0x00000400)        /*!< Transfer direction (master mode) */
#define I2C_CR2_ADD10                       ((uint32_t)0x00000800)        /*!< 10-bit addressing mode (master mode) */
#define I2C_CR2_HEAD10R                     ((uint32_t)0x00001000)        /*!< 10-bit address header only read direction (master mode) */
#define I2C_CR2_START                       ((uint32_t)0x00002000)        /*!< START generation */
#define I2C_CR2_STOP                        ((uint32_t)0x00004000)        /*!< STOP generation (master mode) */
#define I2C_CR2_NACK                        ((uint32_t)0x00008000)        /*!< NACK generation (slave mode) */
#define I2C_CR2_NBYTES                      ((uint32_t)0x00FF0000)        /*!< Number of bytes */
#define I2C_CR2_RELOAD                      ((uint32_t)0x01000000)        /*!< NBYTES reload mode */
#define I2C_CR2_AUTOEND                     ((uint32_t)0x02000000)        /*!< Automatic end mode (master mode) */
#define I2C_CR2_PECBYTE                     ((uint32_t)0x04000000)        /*!< Packet error checking byte */

/*******************  Bit definition for I2C_OAR1 register  ******************/
#define I2C_OAR1_OA1                        ((uint32_t)0x000003FF)        /*!< Interface own address 1 */
#define I2C_OAR1_OA1MODE                    ((uint32_t)0x00000400)        /*!< Own address 1 10-bit mode */
#define I2C_OAR1_OA1EN                      ((uint32_t)0x00008000)        /*!< Own address 1 enable */

