qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L0/TARGET_NUCLEO_L053R8/stm32l053xx.h
/********************  Bits definition for RTC_ALRMASSR register  *************/
#define RTC_ALRMASSR_MASKSS                  ((uint32_t)0x0F000000)
#define RTC_ALRMASSR_MASKSS_0                ((uint32_t)0x01000000)
#define RTC_ALRMASSR_MASKSS_1                ((uint32_t)0x02000000)
#define RTC_ALRMASSR_MASKSS_2                ((uint32_t)0x04000000)
#define RTC_ALRMASSR_MASKSS_3                ((uint32_t)0x08000000)
#define RTC_ALRMASSR_SS                      ((uint32_t)0x00007FFF)

/********************  Bits definition for RTC_ALRMBSSR register  *************/
#define RTC_ALRMBSSR_MASKSS                  ((uint32_t)0x0F000000)
#define RTC_ALRMBSSR_MASKSS_0                ((uint32_t)0x01000000)
#define RTC_ALRMBSSR_MASKSS_1                ((uint32_t)0x02000000)
#define RTC_ALRMBSSR_MASKSS_2                ((uint32_t)0x04000000)
#define RTC_ALRMBSSR_MASKSS_3                ((uint32_t)0x08000000)
#define RTC_ALRMBSSR_SS                      ((uint32_t)0x00007FFF)

/********************  Bits definition for RTC_OR register  ****************/
#define RTC_OR_OUT_RMP                       ((uint32_t)0x00000002)        /*!<  */
#define RTC_OR_ALARMOUTTYPE                  ((uint32_t)0x00000001)        /*!<  */

/* Bit names aliases maintained for legacy */
#define RTC_OR_RTC_OUT_RMP                   RTC_OR_OUT_RMP

/********************  Bits definition for RTC_BKP0R register  ****************/
#define RTC_BKP0R                            ((uint32_t)0xFFFFFFFF)        /*!<  */

/********************  Bits definition for RTC_BKP1R register  ****************/
#define RTC_BKP1R                            ((uint32_t)0xFFFFFFFF)        /*!<  */

/********************  Bits definition for RTC_BKP2R register  ****************/
#define RTC_BKP2R                            ((uint32_t)0xFFFFFFFF)        /*!<  */

/********************  Bits definition for RTC_BKP3R register  ****************/
#define RTC_BKP3R                            ((uint32_t)0xFFFFFFFF)        /*!<  */

/********************  Bits definition for RTC_BKP4R register  ****************/
#define RTC_BKP4R                            ((uint32_t)0xFFFFFFFF)        /*!<  */

/******************************************************************************/
/*                                                                            */
/*                        Serial Peripheral Interface (SPI)                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for SPI_CR1 register  ********************/
#define SPI_CR1_CPHA                        ((uint32_t)0x00000001)            /*!< Clock Phase */
#define SPI_CR1_CPOL                        ((uint32_t)0x00000002)            /*!< Clock Polarity */
#define SPI_CR1_MSTR                        ((uint32_t)0x00000004)            /*!< Master Selection */
#define SPI_CR1_BR                          ((uint32_t)0x00000038)            /*!< BR[2:0] bits (Baud Rate Control) */
#define SPI_CR1_BR_0                        ((uint32_t)0x00000008)            /*!< Bit 0 */
#define SPI_CR1_BR_1                        ((uint32_t)0x00000010)            /*!< Bit 1 */
#define SPI_CR1_BR_2                        ((uint32_t)0x00000020)            /*!< Bit 2 */
#define SPI_CR1_SPE                         ((uint32_t)0x00000040)            /*!< SPI Enable */
#define SPI_CR1_LSBFIRST                    ((uint32_t)0x00000080)            /*!< Frame Format */
#define SPI_CR1_SSI                         ((uint32_t)0x00000100)            /*!< Internal slave select */
#define SPI_CR1_SSM                         ((uint32_t)0x00000200)            /*!< Software slave management */
#define SPI_CR1_RXONLY                      ((uint32_t)0x00000400)            /*!< Receive only */
#define SPI_CR1_DFF                         ((uint32_t)0x00000800)            /*!< Data Frame Format */
#define SPI_CR1_CRCNEXT                     ((uint32_t)0x00001000)            /*!< Transmit CRC next */
#define SPI_CR1_CRCEN                       ((uint32_t)0x00002000)            /*!< Hardware CRC calculation enable */
#define SPI_CR1_BIDIOE                      ((uint32_t)0x00004000)            /*!< Output enable in bidirectional mode */
#define SPI_CR1_BIDIMODE                    ((uint32_t)0x00008000)            /*!< Bidirectional data mode enable */

/*******************  Bit definition for SPI_CR2 register  ********************/
#define SPI_CR2_RXDMAEN                     ((uint32_t)0x00000001)            /*!< Rx Buffer DMA Enable */
#define SPI_CR2_TXDMAEN                     ((uint32_t)0x00000002)            /*!< Tx Buffer DMA Enable */
#define SPI_CR2_SSOE                        ((uint32_t)0x00000004)            /*!< SS Output Enable */
#define SPI_CR2_FRF                         ((uint32_t)0x00000010)            /*!< Frame Format Enable */
#define SPI_CR2_ERRIE                       ((uint32_t)0x00000020)            /*!< Error Interrupt Enable */
#define SPI_CR2_RXNEIE                      ((uint32_t)0x00000040)            /*!< RX buffer Not Empty Interrupt Enable */
#define SPI_CR2_TXEIE                       ((uint32_t)0x00000080)            /*!< Tx buffer Empty Interrupt Enable */

/********************  Bit definition for SPI_SR register  ********************/
#define SPI_SR_RXNE                         ((uint32_t)0x00000001)            /*!< Receive buffer Not Empty */
#define SPI_SR_TXE                          ((uint32_t)0x00000002)            /*!< Transmit buffer Empty */
#define SPI_SR_CHSIDE                       ((uint32_t)0x00000004)            /*!< Channel side */
#define SPI_SR_UDR                          ((uint32_t)0x00000008)            /*!< Underrun flag */
#define SPI_SR_CRCERR                       ((uint32_t)0x00000010)            /*!< CRC Error flag */
#define SPI_SR_MODF                         ((uint32_t)0x00000020)            /*!< Mode fault */
#define SPI_SR_OVR                          ((uint32_t)0x00000040)            /*!< Overrun flag */
#define SPI_SR_BSY                          ((uint32_t)0x00000080)            /*!< Busy flag */
#define SPI_SR_FRE                          ((uint32_t)0x00000100)            /*!< TI frame format error */  

/********************  Bit definition for SPI_DR register  ********************/
#define SPI_DR_DR                           ((uint32_t)0x0000FFFF)            /*!< Data Register */

